{
  "ip": "192.168.1.15",
  "os": "Desconocido",
  "shodan": {},
  "activos": [
    {
      "port": "135",
      "protocol": "tcp",
      "name": "msrpc",
      "product": "Microsoft Windows RPC",
      "version": "",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [
        {
          "id": "CVE-2000-0771",
          "score": 2.1,
          "severity": "LOW",
          "published": "2000-10-20T04:00:00.000",
          "summary": "Microsoft Windows 2000 allows local users to cause a denial of service by corrupting the local security policy via malformed RPC traffic, aka the \"Local Security Policy Corruption\" vulnerability.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2000-0771"
        },
        {
          "id": "CVE-2001-0509",
          "score": 5,
          "severity": "MEDIUM",
          "published": "2001-09-20T04:00:00.000",
          "summary": "Vulnerabilities in RPC servers in (1) Microsoft Exchange Server 2000 and earlier, (2) Microsoft SQL Server 2000 and earlier, (3) Windows NT 4.0, and (4) Windows 2000 allow remote attackers to cause a denial of service via malformed inputs.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2001-0509"
        },
        {
          "id": "CVE-2002-1140",
          "score": 5,
          "severity": "MEDIUM",
          "published": "2002-10-11T04:00:00.000",
          "summary": "The Sun Microsystems RPC library Services for Unix 3.0 Interix SD, as implemented on Microsoft Windows NT4, 2000, and XP, allows remote attackers to cause a denial of service (service hang) via malformed packet fragments, aka \"Improper parameter size check leading to denial of service.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2002-1140"
        },
        {
          "id": "CVE-2002-1141",
          "score": 5,
          "severity": "MEDIUM",
          "published": "2002-10-11T04:00:00.000",
          "summary": "An input validation error in the Sun Microsystems RPC library Services for Unix 3.0 Interix SD, as implemented on Microsoft Windows NT4, 2000, and XP, allows remote attackers to cause a denial of service via malformed fragmented RPC client packets, aka \"Denial of service by sending an invalid RPC request.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2002-1141"
        },
        {
          "id": "CVE-2003-0003",
          "score": 7.5,
          "severity": "HIGH",
          "published": "2003-02-07T05:00:00.000",
          "summary": "Buffer overflow in the RPC Locator service for Microsoft Windows NT 4.0, Windows NT 4.0 Terminal Server Edition, Windows 2000, and Windows XP allows local users to execute arbitrary code via an RPC call to the service containing certain parameter information.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2003-0003"
        },
        {
          "id": "CVE-2003-0352",
          "score": 7.5,
          "severity": "HIGH",
          "published": "2003-08-18T04:00:00.000",
          "summary": "Buffer overflow in a certain DCOM interface for RPC in Microsoft Windows NT 4.0, 2000, XP, and Server 2003 allows remote attackers to execute arbitrary code via a malformed message, as exploited by the Blaster/MSblast/LovSAN and Nachi/Welchia worms.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2003-0352"
        },
        {
          "id": "CVE-2003-0807",
          "score": 5,
          "severity": "MEDIUM",
          "published": "2004-06-01T04:00:00.000",
          "summary": "Buffer overflow in the COM Internet Services and in the RPC over HTTP Proxy components for Microsoft Windows NT Server 4.0, NT 4.0 Terminal Server Edition, 2000, XP, and Server 2003 allows remote attackers to cause a denial of service via a crafted request.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2003-0807"
        },
        {
          "id": "CVE-2004-0116",
          "score": 5,
          "severity": "MEDIUM",
          "published": "2004-06-01T04:00:00.000",
          "summary": "An Activation function in the RPCSS Service involved with DCOM activation for Microsoft Windows 2000, XP, and 2003 allows remote attackers to cause a denial of service (memory consumption) via an activation request with a large length field.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2004-0116"
        },
        {
          "id": "CVE-2004-0124",
          "score": 2.6,
          "severity": "LOW",
          "published": "2004-06-01T04:00:00.000",
          "summary": "The DCOM RPC interface for Microsoft Windows NT 4.0, 2000, XP, and Server 2003 allows remote attackers to cause network communications via an \"alter context\" call that contains additional data, aka the \"Object Identity Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2004-0124"
        },
        {
          "id": "CVE-2004-0569",
          "score": 7.5,
          "severity": "HIGH",
          "published": "2004-11-03T05:00:00.000",
          "summary": "The RPC Runtime Library for Microsoft Windows NT 4.0 allows remote attackers to read active memory or cause a denial of service (system crash) via a malicious message, possibly related to improper length values.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2004-0569"
        },
        {
          "id": "CVE-2005-3644",
          "score": 7.8,
          "severity": "HIGH",
          "published": "2005-11-17T11:02:00.000",
          "summary": "PNP_GetDeviceList (upnp_getdevicelist) in UPnP for Microsoft Windows 2000 SP4 and earlier, and possibly Windows XP SP1 and earlier, allows remote attackers to cause a denial of service (memory consumption) via a DCE RPC request that specifies a large output buffer size, a variant of CVE-2006-6296, and a different vulnerability than CVE-2005-2120.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2005-3644"
        },
        {
          "id": "CVE-2006-0013",
          "score": 6.5,
          "severity": "MEDIUM",
          "published": "2006-02-14T19:06:00.000",
          "summary": "Buffer overflow in the Web Client service (WebClnt.dll) for Microsoft Windows XP SP1 and SP2, and Server 2003 up to SP1, allows remote authenticated users or Guests to execute arbitrary code via crafted RPC requests, a different vulnerability than CVE-2005-1207.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2006-0013"
        },
        {
          "id": "CVE-2006-2380",
          "score": 4.3,
          "severity": "MEDIUM",
          "published": "2006-06-13T19:06:00.000",
          "summary": "Microsoft Windows 2000 SP4 does not properly validate an RPC server during mutual authentication over SSL, which allows remote attackers to spoof an RPC server, aka the \"RPC Mutual Authentication Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2006-2380"
        },
        {
          "id": "CVE-2006-3439",
          "score": 10,
          "severity": "HIGH",
          "published": "2006-08-09T01:04:00.000",
          "summary": "Buffer overflow in the Server Service in Microsoft Windows 2000 SP4, XP SP1 and SP2, and Server 2003 SP1 allows remote attackers, including anonymous users, to execute arbitrary code via a crafted RPC message, a different vulnerability than CVE-2006-1314.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2006-3439"
        },
        {
          "id": "CVE-2006-4691",
          "score": 10,
          "severity": "HIGH",
          "published": "2006-11-14T21:07:00.000",
          "summary": "Stack-based buffer overflow in the NetpManageIPCConnect function in the Workstation service (wkssvc.dll) in Microsoft Windows 2000 SP4 and XP SP2 allows remote attackers to execute arbitrary code via NetrJoinDomain2 RPC messages with a long hostname.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2006-4691"
        },
        {
          "id": "CVE-2006-6296",
          "score": 6.1,
          "severity": "MEDIUM",
          "published": "2006-12-05T11:28:00.000",
          "summary": "The RpcGetPrinterData function in the Print Spooler (spoolsv.exe) service in Microsoft Windows 2000 SP4 and earlier, and possibly Windows XP SP1 and earlier, allows remote attackers to cause a denial of service (memory consumption) via an RPC request that specifies a large 'offered' value (output buffer size), a variant of CVE-2005-3644.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2006-6296"
        },
        {
          "id": "CVE-2006-6723",
          "score": 7.8,
          "severity": "HIGH",
          "published": "2006-12-26T20:28:00.000",
          "summary": "The Workstation service in Microsoft Windows 2000 SP4 and XP SP2 allows remote attackers to cause a denial of service (memory consumption) via a large maxlen value in an NetrWkstaUserEnum RPC request.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2006-6723"
        },
        {
          "id": "CVE-2007-1748",
          "score": 10,
          "severity": "HIGH",
          "published": "2007-04-13T18:19:00.000",
          "summary": "Stack-based buffer overflow in the RPC interface in the Domain Name System (DNS) Server Service in Microsoft Windows 2000 Server SP 4, Server 2003 SP 1, and Server 2003 SP 2 allows remote attackers to execute arbitrary code via a long zone name containing character constants represented by escape sequences.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2007-1748"
        },
        {
          "id": "CVE-2007-2228",
          "score": 7.8,
          "severity": "HIGH",
          "published": "2007-10-09T22:17:00.000",
          "summary": "rpcrt4.dll (aka the RPC runtime library) in Microsoft Windows XP SP2, XP Professional x64 Edition, Server 2003 SP1 and SP2, Server 2003 x64 Edition and x64 Edition SP2, and Vista and Vista x64 Edition allows remote attackers to cause a denial of service (RPCSS service stop and system restart) via an RPC request that uses NTLMSSP PACKET authentication with a zero-valued verification trailer signature, which triggers an invalid dereference.  NOTE: this also affects Windows 2000 SP4, although the impact is an information leak.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2007-2228"
        },
        {
          "id": "CVE-2007-3039",
          "score": 9,
          "severity": "HIGH",
          "published": "2007-12-12T00:46:00.000",
          "summary": "Stack-based buffer overflow in the Microsoft Message Queuing (MSMQ) service in Microsoft Windows 2000 Server SP4, Windows 2000 Professional SP4, and Windows XP SP2 allows attackers to execute arbitrary code via a long string in an opnum 0x06 RPC call to port 2103.  NOTE: this is remotely exploitable on Windows 2000 Server.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2007-3039"
        },
        {
          "id": "CVE-2008-3479",
          "score": 10,
          "severity": "HIGH",
          "published": "2008-10-15T00:12:15.910",
          "summary": "Heap-based buffer overflow in the Microsoft Message Queuing (MSMQ) service (mqsvc.exe) in Microsoft Windows 2000 SP4 allows remote attackers to read memory contents and execute arbitrary code via a crafted RPC call, related to improper processing of parameters to string APIs, aka \"Message Queuing Service Remote Code Execution Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2008-3479"
        },
        {
          "id": "CVE-2008-4250",
          "score": 10,
          "severity": "HIGH",
          "published": "2008-10-23T22:00:01.357",
          "summary": "The Server service in Microsoft Windows 2000 SP4, XP SP2 and SP3, Server 2003 SP1 and SP2, Vista Gold and SP1, Server 2008, and 7 Pre-Beta allows remote attackers to execute arbitrary code via a crafted RPC request that triggers the overflow during path canonicalization, as exploited in the wild by Gimmiv.A in October 2008, aka \"Server Service Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2008-4250"
        },
        {
          "id": "CVE-2009-0079",
          "score": 6.9,
          "severity": "MEDIUM",
          "published": "2009-04-15T08:00:00.377",
          "summary": "The RPCSS service in Microsoft Windows XP SP2 and SP3 and Server 2003 SP1 and SP2 does not properly implement isolation among a set of distinct processes that (1) all run under the NetworkService account or (2) all run under the LocalService account, which allows local users to gain privileges by accessing the resources of one of the processes, aka \"Windows RPCSS Service Isolation Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-0079"
        },
        {
          "id": "CVE-2009-0228",
          "score": 10,
          "severity": "HIGH",
          "published": "2009-06-10T18:00:00.217",
          "summary": "Stack-based buffer overflow in the EnumeratePrintShares function in Windows Print Spooler Service (win32spl.dll) in Microsoft Windows 2000 SP4 allows remote printer servers to execute arbitrary code via a crafted ShareName in a response to an RPC request, related to \"printing data structures,\" aka \"Buffer Overflow in Print Spooler Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-0228"
        },
        {
          "id": "CVE-2009-0230",
          "score": 9,
          "severity": "HIGH",
          "published": "2009-06-10T18:00:00.280",
          "summary": "The Windows Print Spooler in Microsoft Windows 2000 SP4, XP SP2 and SP3, Server 2003 SP2, Vista Gold, SP1, and SP2, and Server 2008 SP2 allows remote authenticated users to gain privileges via a crafted RPC message that triggers loading of a DLL file from an arbitrary directory, aka \"Print Spooler Load Library Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-0230"
        },
        {
          "id": "CVE-2009-0568",
          "score": 10,
          "severity": "HIGH",
          "published": "2009-06-10T18:00:00.360",
          "summary": "The RPC Marshalling Engine (aka NDR) in Microsoft Windows 2000 SP4, XP SP2 and SP3, Server 2003 SP2, Vista Gold, SP1, and SP2, and Server 2008 SP2 does not properly maintain its internal state, which allows remote attackers to overwrite arbitrary memory locations via a crafted RPC message that triggers incorrect pointer reading, related to \"IDL interfaces containing a non-conformant varying array\" and FC_SMVARRAY, FC_LGVARRAY, FC_VARIABLE_REPEAT, and FC_VARIABLE_OFFSET, aka \"RPC Marshalling Engine Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-0568"
        },
        {
          "id": "CVE-2009-1544",
          "score": 8.8,
          "severity": "HIGH",
          "published": "2009-08-12T17:30:00.563",
          "summary": "Double free vulnerability in the Workstation service in Microsoft Windows allows remote authenticated users to gain privileges via a crafted RPC message to a Windows XP SP2 or SP3 or Server 2003 SP2 system, or cause a denial of service via a crafted RPC message to a Vista Gold, SP1, or SP2 or Server 2008 Gold or SP2 system, aka \"Workstation Service Memory Corruption Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-1544"
        },
        {
          "id": "CVE-2009-2523",
          "score": 10,
          "severity": "HIGH",
          "published": "2009-11-11T19:30:00.407",
          "summary": "The License Logging Server (llssrv.exe) in Microsoft Windows 2000 SP4 allows remote attackers to execute arbitrary code via an RPC message containing a string without a null terminator, which triggers a heap-based buffer overflow in the LlsrLicenseRequestW method, aka \"License Logging Server Heap Overflow Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-2523"
        },
        {
          "id": "CVE-2010-2567",
          "score": 9.3,
          "severity": "HIGH",
          "published": "2010-09-15T19:00:18.917",
          "summary": "The RPC client implementation in Microsoft Windows XP SP2 and SP3 and Server 2003 SP2 does not properly allocate memory during the parsing of responses, which allows remote RPC servers and man-in-the-middle attackers to execute arbitrary code via a malformed response, aka \"RPC Memory Corruption Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2010-2567"
        },
        {
          "id": "CVE-2010-2729",
          "score": 9.3,
          "severity": "HIGH",
          "published": "2010-09-15T19:00:19.103",
          "summary": "The Print Spooler service in Microsoft Windows XP SP2 and SP3, Windows Server 2003 SP2, Windows Vista SP1 and SP2, Windows Server 2008 Gold, SP2, and R2, and Windows 7, when printer sharing is enabled, does not properly validate spooler access permissions, which allows remote attackers to create files in a system directory, and consequently execute arbitrary code, by sending a crafted print request over RPC, as exploited in the wild in September 2010, aka \"Print Spooler Service Impersonation Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2010-2729"
        },
        {
          "id": "CVE-2010-2742",
          "score": 5.4,
          "severity": "MEDIUM",
          "published": "2010-12-16T19:33:02.223",
          "summary": "The Netlogon RPC Service in Microsoft Windows Server 2003 SP2 and Server 2008 Gold, SP2, and R2, when the domain controller role is enabled, allows remote attackers to cause a denial of service (NULL pointer dereference and reboot) via a crafted RPC packet, aka \"Netlogon RPC Null dereference DOS Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2010-2742"
        },
        {
          "id": "CVE-2013-3175",
          "score": 10,
          "severity": "HIGH",
          "published": "2013-08-14T11:10:36.203",
          "summary": "Microsoft Windows XP SP2 and SP3, Windows Server 2003 SP2, Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8, Windows Server 2012, and Windows RT allow remote attackers to execute arbitrary code via a malformed asynchronous RPC request, aka \"Remote Procedure Call Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2013-3175"
        },
        {
          "id": "CVE-2014-0316",
          "score": 7.5,
          "severity": "HIGH",
          "published": "2014-08-12T21:55:06.117",
          "summary": "Memory leak in the Local RPC (LRPC) server implementation in Microsoft Windows 7 SP1, Windows Server 2008 R2 SP1, Windows 8, Windows 8.1, Windows Server 2012 Gold and R2, and Windows RT Gold and 8.1 allows remote attackers to cause a denial of service (memory consumption) and bypass the ASLR protection mechanism via a crafted client that sends messages with an invalid data view, aka \"LRPC ASLR Bypass Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2014-0316"
        },
        {
          "id": "CVE-2015-2370",
          "score": 7.2,
          "severity": "HIGH",
          "published": "2015-07-14T22:59:04.840",
          "summary": "The authentication implementation in the RPC subsystem in Microsoft Windows Server 2003 SP2 and R2 SP2, Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8, Windows 8.1, Windows Server 2012 Gold and R2, and Windows RT Gold and 8.1 does not prevent DCE/RPC connection reflection, which allows local users to gain privileges via a crafted application, aka \"Windows RPC Elevation of Privilege Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2015-2370"
        },
        {
          "id": "CVE-2016-0128",
          "score": 6.8,
          "severity": "MEDIUM",
          "published": "2016-04-12T23:59:06.587",
          "summary": "The SAM and LSAD protocol implementations in Microsoft Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8.1, Windows Server 2012 Gold and R2, Windows RT 8.1, and Windows 10 Gold and 1511 do not properly establish an RPC channel, which allows man-in-the-middle attackers to perform protocol-downgrade attacks and impersonate users by modifying the client-server data stream, aka \"Windows SAM and LSAD Downgrade Vulnerability\" or \"BADLOCK.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2016-0128"
        },
        {
          "id": "CVE-2016-0178",
          "score": 8.8,
          "severity": "HIGH",
          "published": "2016-05-11T01:59:17.640",
          "summary": "The RPC NDR Engine in Microsoft Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8.1, Windows Server 2012 Gold and R2, Windows RT 8.1, and Windows 10 Gold and 1511 mishandles free operations, which allows remote attackers to execute arbitrary code via malformed RPC requests, aka \"RPC Network Data Representation Engine Elevation of Privilege Vulnerability.\"",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2016-0178"
        },
        {
          "id": "CVE-2020-1113",
          "score": 7.5,
          "severity": "HIGH",
          "published": "2020-05-21T23:15:15.197",
          "summary": "A security feature bypass vulnerability exists in Microsoft Windows when the Task Scheduler service fails to properly verify client connections over RPC, aka 'Windows Task Scheduler Security Feature Bypass Vulnerability'.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2020-1113"
        }
      ],
      "probabilidad": 10,
      "impacto": 4.666666666666666,
      "riesgo": 46.66666666666666,
      "tratamiento": "AVOID"
    },
    {
      "port": "4000",
      "protocol": "tcp",
      "name": "http",
      "product": "Node.js Express framework",
      "version": "",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [
        {
          "id": "CVE-2014-6393",
          "score": 6.1,
          "severity": "MEDIUM",
          "published": "2017-08-09T18:29:00.480",
          "summary": "The Express web framework before 3.11 and 4.x before 4.5 for Node.js does not provide a charset field in HTTP Content-Type headers in 400 level responses, which might allow remote attackers to conduct cross-site scripting (XSS) attacks via characters in a non-standard encoding.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2014-6393"
        },
        {
          "id": "CVE-2016-10539",
          "score": 7.5,
          "severity": "HIGH",
          "published": "2018-05-31T20:29:01.407",
          "summary": "negotiator is an HTTP content negotiator for Node.js and is used by many modules and frameworks including Express and Koa. The header for \"Accept-Language\", when parsed by negotiator 0.6.0 and earlier is vulnerable to Regular Expression Denial of Service via a specially crafted string.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2016-10539"
        }
      ],
      "probabilidad": 7.5,
      "impacto": 4.666666666666666,
      "riesgo": 34.99999999999999,
      "tratamiento": "MITIGATE"
    },
    {
      "port": "912",
      "protocol": "tcp",
      "name": "vmware-auth",
      "product": "VMware Authentication Daemon",
      "version": "1.0",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [
        {
          "id": "CVE-2009-3707",
          "score": 5,
          "severity": "MEDIUM",
          "published": "2009-10-16T16:30:00.907",
          "summary": "VMware Authentication Daemon 1.0 in vmware-authd.exe in the VMware Authorization Service in VMware Workstation 7.0 before 7.0.1 build 227600 and 6.5.x before 6.5.4 build 246459, VMware Player 3.0 before 3.0.1 build 227600 and 2.5.x before 2.5.4 build 246459, VMware ACE 2.6 before 2.6.1 build 227600 and 2.5.x before 2.5.4 build 246459, and VMware Server 2.x allows remote attackers to cause a denial of service (process crash) via a \\x25\\xFF sequence in the USER and PASS commands, related to a \"format string DoS\" issue. NOTE: some of these details are obtained from third party information.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-3707"
        },
        {
          "id": "CVE-2009-4811",
          "score": 5,
          "severity": "MEDIUM",
          "published": "2010-04-27T15:30:00.420",
          "summary": "VMware Authentication Daemon 1.0 in vmware-authd.exe in the VMware Authorization Service in VMware Workstation 7.0 before 7.0.1 build 227600 and 6.5.x before 6.5.4 build 246459, VMware Player 3.0 before 3.0.1 build 227600 and 2.5.x before 2.5.4 build 246459, VMware ACE 2.6 before 2.6.1 build 227600 and 2.5.x before 2.5.4 build 246459, and VMware Server 2.x allows remote attackers to cause a denial of service (process crash) via a \\x25\\x90 sequence in the USER and PASS commands, a related issue to CVE-2009-3707.  NOTE: some of these details are obtained from third party information.",
          "url": "https://nvd.nist.gov/vuln/detail/CVE-2009-4811"
        }
      ],
      "probabilidad": 5,
      "impacto": 4.666666666666666,
      "riesgo": 23.33333333333333,
      "tratamiento": "MITIGATE"
    },
    {
      "port": "139",
      "protocol": "tcp",
      "name": "netbios-ssn",
      "product": "Microsoft Windows netbios-ssn",
      "version": "",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [],
      "probabilidad": 0,
      "impacto": 4.666666666666666,
      "riesgo": 0,
      "tratamiento": "ACCEPT"
    },
    {
      "port": "445",
      "protocol": "tcp",
      "name": "microsoft-ds",
      "product": "",
      "version": "",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [],
      "probabilidad": 0,
      "impacto": 4.666666666666666,
      "riesgo": 0,
      "tratamiento": "ACCEPT"
    },
    {
      "port": "902",
      "protocol": "tcp",
      "name": "vmware-auth",
      "product": "VMware Authentication Daemon",
      "version": "1.10",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [],
      "probabilidad": 0,
      "impacto": 4.666666666666666,
      "riesgo": 0,
      "tratamiento": "ACCEPT"
    },
    {
      "port": "2179",
      "protocol": "tcp",
      "name": "vmrdp",
      "product": "",
      "version": "",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [],
      "probabilidad": 0,
      "impacto": 4.666666666666666,
      "riesgo": 0,
      "tratamiento": "ACCEPT"
    },
    {
      "port": "5357",
      "protocol": "tcp",
      "name": "http",
      "product": "Microsoft HTTPAPI httpd",
      "version": "2.0",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [],
      "probabilidad": 0,
      "impacto": 4.666666666666666,
      "riesgo": 0,
      "tratamiento": "ACCEPT"
    },
    {
      "port": "8080",
      "protocol": "tcp",
      "name": "http-proxy",
      "product": "",
      "version": "",
      "tipo": "infrastructure",
      "cia": {
        "confidencialidad": 4,
        "integridad": 4,
        "disponibilidad": 3
      },
      "criticidad": 1,
      "cves": [],
      "probabilidad": 0,
      "impacto": 4.666666666666666,
      "riesgo": 0,
      "tratamiento": "ACCEPT"
    }
  ],
  "heatmap": [
    {
      "x": 5,
      "y": 5,
      "riesgo": 46.66666666666666,
      "activo": "msrpc Microsoft Windows RPC "
    },
    {
      "x": 1,
      "y": 5,
      "riesgo": 0,
      "activo": "netbios-ssn Microsoft Windows netbios-ssn "
    },
    {
      "x": 1,
      "y": 5,
      "riesgo": 0,
      "activo": "microsoft-ds  "
    },
    {
      "x": 1,
      "y": 5,
      "riesgo": 0,
      "activo": "vmware-auth VMware Authentication Daemon 1.10"
    },
    {
      "x": 3,
      "y": 5,
      "riesgo": 23.33333333333333,
      "activo": "vmware-auth VMware Authentication Daemon 1.0"
    },
    {
      "x": 1,
      "y": 5,
      "riesgo": 0,
      "activo": "vmrdp  "
    },
    {
      "x": 4,
      "y": 5,
      "riesgo": 34.99999999999999,
      "activo": "http Node.js Express framework "
    },
    {
      "x": 1,
      "y": 5,
      "riesgo": 0,
      "activo": "http Microsoft HTTPAPI httpd 2.0"
    },
    {
      "x": 1,
      "y": 5,
      "riesgo": 0,
      "activo": "http-proxy  "
    }
  ],
  "timestamp": "2025-07-02T21:15:31.430Z"
}